In [1]:
#Import libraries for data processing 

import pandas as pd
import csv

## BritishAirways Comma Seperated Value

In [33]:
#Reading csv files, such as British airways 

ba_reviews = pd.read_csv("ba_reviews.csv")

In [30]:
#Applying isnull() to check null values in the dataframe and using sum() to see any total value in each column.

ba_reviews.isnull().sum()

header                 0
author                 0
date                   0
place                  0
content                0
aircraft               0
traveller_type         1
seat_type              0
route                  0
date_flown             0
recommended            0
trip_verified          0
rating                 0
seat_comfort           0
cabin_staff_service    0
food_beverages         0
ground_service         0
value_for_money        0
entertainment          0
dtype: int64

In [49]:
ba_reviews.count()

header                 1324
author                 1324
date                   1324
place                  1324
content                1324
aircraft               1324
traveller_type         1323
seat_type              1324
route                  1324
date_flown             1324
recommended            1324
trip_verified          1324
rating                 1324
seat_comfort           1324
cabin_staff_service    1324
food_beverages         1324
ground_service         1324
value_for_money        1324
entertainment          1324
dtype: int64

In [46]:
#Selecting rows with null values by using boolean masks is True
ba_masks = ba_reviews.isnull().any(axis=1)

ba_rows = ba_reviews[ba_masks]

ba_rows

,header,author,date,place,content,aircraft,traveller_type,seat_type,route,date_flown,recommended,trip_verified,rating,seat_comfort,cabin_staff_service,food_beverages,ground_service,value_for_money,entertainment
14,British Airways absolutely does not care,May Porter,01/09/2023,United Kingdom,British Airways absolutely does not care. My...,Boeing 777,NaN,Economy Class,Los Angeles to London,01/08/2023,no,Verified,1,1,1,1,1,1,1

In [57]:
#Selecting not null values for visualisation 
ba_masks = ba_reviews.notnull().all(axis=1)

ba_rows_clean = ba_reviews[ba_masks]

ba_clean = ba_rows_clean.reset_index(drop=True)

In [60]:
#Convert clean dataframe to csv file for Tableau visualisatoin
ba_clean.to_csv('ba_reviews_clean.csv', index = False)

## Countries Comma Seperated Value

In [38]:
#Reading csv files, such as countries CSV

countries = pd.read_csv("Countries.csv")

In [73]:
countries

                       Country Code Continent           Region
0                  Afghanistan  AFG      Asia    Southern Asia
1                Åland Islands  ALA    Europe  Northern Europe
2                      Albania  ALB    Europe  Southern Europe
3                      Algeria  DZA    Africa  Northern Africa
4               American Samoa  ASM   Oceania        Polynesia
..                         ...  ...       ...              ...
246  Wallis and Futuna Islands  WLF   Oceania        Polynesia
247             Western Sahara  ESH    Africa  Northern Africa
248                      Yemen  YEM      Asia     Western Asia
249                     Zambia  ZMB    Africa   Eastern Africa
250                   Zimbabwe  ZWE    Africa   Eastern Africa

[251 rows x 4 columns]

In [40]:
#Applying isnull() to check null values in the dataframe and using sum() to see any total value in each column.

countries.isnull().sum()

Country      0
Code         1
Continent    0
Region       0
dtype: int64

In [65]:
#Selecting rows with null values by using boolean masks is True
ct_masks = countries.isnull().any(axis=1)

ct_rows = countries[ct_masks]

ct_rows

    Country Code Continent           Region
196    Sark  NaN    Europe  Northern Europe

In [70]:
#Selecting rows with not null values by using boolean masks is True
ct_masks = countries.notnull().all(axis=1)

ct_clean_rows = countries[ct_masks]

ct_clean = ct_clean_rows.reset_index(drop=True)

In [71]:
ct_clean

                       Country Code Continent           Region
0                  Afghanistan  AFG      Asia    Southern Asia
1                Åland Islands  ALA    Europe  Northern Europe
2                      Albania  ALB    Europe  Southern Europe
3                      Algeria  DZA    Africa  Northern Africa
4               American Samoa  ASM   Oceania        Polynesia
..                         ...  ...       ...              ...
245  Wallis and Futuna Islands  WLF   Oceania        Polynesia
246             Western Sahara  ESH    Africa  Northern Africa
247                      Yemen  YEM      Asia     Western Asia
248                     Zambia  ZMB    Africa   Eastern Africa
249                   Zimbabwe  ZWE    Africa   Eastern Africa

[250 rows x 4 columns]

In [72]:
#Convert clean dataframe to csv file for Tableau visualisatoin
ct_clean.to_csv("countries_clean.csv", index = False)